Revit 2024 API
DirectShape.AddReferencePlane Method (Plane, DirectShapeReferenceOptions)
 Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public void AddReferencePlane(
	Plane refPlane,
	DirectShapeReferenceOptions options
)
Visual Basic
Public Sub AddReferencePlane ( _
	refPlane As Plane, _
	options As DirectShapeReferenceOptions _
)
Visual C++
public:
void AddReferencePlane(
	Plane^ refPlane,
	DirectShapeReferenceOptions^ options
)
Parameters
refPlane
Type: Autodesk.Revit.DB.Plane
 The geometry of the new reference plane.
options
Type: Autodesk.Revit.DB.DirectShapeReferenceOptions
 The options that are used to configure the new reference plane.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  options cannot be used to add a reference object to this DirectShape.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DirectShape Class
AddReferencePlane Overload
Autodesk.Revit.DB Namespace